hydarealman/mystudy/stm32project/13-4待机模式+实时时钟/System/MyRTC.c
#include "stm32f10x.h"                  // Device header
#include "MyRTC.h"
#include <time.h>

uint16_t MyRTC_Time[] = {2023,1,1,23,59,55};

void MyRTC_SetTime(void) 
{
	time_t time_cnt;
	struct tm time_date;
	
	time_date.tm_year = MyRTC_Time[0] - 1900;
	time_date.tm_mon = MyRTC_Time[1] - 1;
	time_date.tm_mday = MyRTC_Time[2];
	time_date.tm_hour = MyRTC_Time[3];
	time_date.tm_min = MyRTC_Time[4];
	time_date.tm_sec = MyRTC_Time[5];
	
	time_cnt = mktime(&time_date) - 8*60*60;
	
	RTC_SetCounter(time_cnt);
}

void MyRTC_Init(void)
{
	// RTC与电源控制模块相关,需要使能PWR时钟
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_PWR,ENABLE);
	// RTC使用备份寄存器存储数据,需要使能备份域时钟
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_BKP,ENABLE);

	// 允许访问备份域
	PWR_BackupAccessCmd(ENABLE);
	
	if (BKP_ReadBackupRegister(BKP_DR1) != 0xA5A5) {
		// 开启LSE(外部低速晶振)
		RCC_LSEConfig(RCC_LSE_ON);
		while(RCC_GetFlagStatus(RCC_FLAG_LSERDY) != SET);
		
		// 配置RTC时钟源: 选择LSE作为RTC的时钟源 使能RTC时钟
		RCC_RTCCLKConfig(RCC_RTCCLKSource_LSE);
		RCC_RTCCLKCmd(ENABLE);
		
		// 同步和等待操作
		RTC_WaitForSynchro();
		RTC_WaitForLastTask();
		
		// 设置预分频器
		RTC_SetPrescaler(32768 - 1);
		RTC_WaitForLastTask();
		
		// 设置初始时间
		RTC_WaitForLastTask();
		
		MyRTC_SetTime();
		
		BKP_WriteBackupRegister(BKP_DR1,0xA5A5);
	}
	else {
		// 同步和等待操作
		RTC_WaitForSynchro();
		RTC_WaitForLastTask();
	}
}

void MyRTC_ReadTime(void) 
{
	time_t time_cnt;
	struct tm time_date;
	
	time_cnt = RTC_GetCounter() + 8*60*60;
	
	time_date = *localtime(&time_cnt);
	
	MyRTC_Time[0] = time_date.tm_year + 1900;
	MyRTC_Time[1] = time_date.tm_mon + 1;
	MyRTC_Time[2] = time_date.tm_mday;
	MyRTC_Time[3] = time_date.tm_hour;
	MyRTC_Time[4] = time_date.tm_min;
	MyRTC_Time[5] = time_date.tm_sec;
}

